Tekla.Structures.Model.CylindricalSurfaceNode.IsAutomatic
Gets a value indicating whether this geometry node was automatically generated (returns false if it was originally a user-defined part)

Tekla.Structures.Model.CylindricalSurfaceNode.Surface
Gets or sets the contour points of cylindrical surface geometry.